all/all/ipc/onvif/SetTimeTempFile.xml

POST /onvif/device_service HTTP/1.1
HOST: 192.168.1.23
User-Agent: HTTP_USER_AGENT
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*.*;q=0.8
Accept-Language: ZH-cn;zh;q=0.5
Accept-Charset: gb2312,utf8;q=0.7,*;q=0.7
Authorization: Basic YWRtaW46MTIzNDU=
Content-Type: application/soap+xml; charset="utf-8"
Content-Length: 1425

<?xml version="1.0" encoding="UTF-8" ?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tds="http://www.onvif.org/ver10/device/wsdl" xmlns:tt="http://www.onvif.org/ver10/schema">
<soap:Header>
<wsse:Security soap:mustUnderstand="true" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<wsse:UsernameToken  wsu:Id="UsernameToken-35" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
<wsse:Username>admin</wsse:Username>
<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">3o0q5Uyo7yFTH2LF4TrFFSxos40=</wsse:Password>
<wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">H+SIutMvQmS5RhXCD2TqtQ==</wsse:Nonce>
<wsu:Created>2017-05-22T10:43:10Z</wsu:Created>
</wsse:UsernameToken>
</wsse:Security>
</soap:Header>
<soap:Body>
<tds:SetSystemDateAndTime>
<tds:DateTimeType>Manual</tds:DateTimeType>
<tds:DaylightSavings>false</tds:DaylightSavings>
<tds:TimeZone>
<tt:TZ>CST-8</tt:TZ>
</tds:TimeZone>
<tds:UTCDateTime>
<tt:Time>
<tt:Hour>10</tt:Hour>
<tt:Minute>43</tt:Minute>
<tt:Second>10</tt:Second>
</tt:Time>
<tt:Date>
<tt:Year>2017</tt:Year>
<tt:Month>5</tt:Month>
<tt:Day>22</tt:Day>
</tt:Date>
</tds:UTCDateTime>
</tds:SetSystemDateAndTime>
</soap:Body>
</soap:Envelope>
